<a href="https://colab.research.google.com/github/barkle2/Programming/blob/master/%5BPython%5D%20Tutorial/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
## 1. DataFrame 만들기

In [1]:
import pandas as pd
import numpy as np

### 1-1. 파일 읽어서 DataFrame 만들기

In [2]:
# csv 파일 읽어서 DataFrame 만들기
df = pd.read_csv('https://raw.githubusercontent.com/barkle2/Programming/master/%5BPython%5D%20Tutorial/friends.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [3]:
# DataFrame의 타입
type(df)

pandas.core.frame.DataFrame

### 1-2. Python code로 DataFrame 만들기

In [4]:
# DataFrame의 컬럼은 Series / DataFrame은 Series의 결합체
print(type(df.name))
print(type(df.age))
print(type(df.job))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [5]:
# Series는 List로 만들 수 있다.
s1 = pd.core.series.Series( [1,2,3] )
s2 = pd.core.series.Series( ['one', 'two', 'three'] )

In [6]:
# Series가 있으면 DataFrame을 만들 수 있다.
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three

In [7]:
# 우선 List를 만든다.
friend_dict_list = [
  {'name': 'John', 'age':25, 'job': 'student'},
  {'name': 'Nate', 'age':30, 'job': 'teacher'}
]

In [8]:
# List로 DataFrame을 만든다.
df = pd.DataFrame(friend_dict_list)
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [9]:
# Records_List와 Column_List로 DataFrame 만들기
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list, columns=column_name)
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

### 1-3.DataFrame 파일로 저장하기

In [10]:
# csv 파일로 저장하기
df.to_csv('friends.csv')

In [11]:
# csv 파일로 저장하기(옵션 추가)
df.to_csv('friends.csv', index=False, header=False, na_rep='-')

### 1-4. Colab에서 Local File Upload, Download 하기

In [12]:
# 로컬 파일 불러오기
from google.colab import files

uploaded = files.upload()

for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(name=fn, length=len(uploaded[fn])))

In [13]:
# 생성한 파일 다운로드하기
files.download('friends.csv')

## 2. DataFrame 조회/선택/조작

### 2-1. 단순 조회

In [14]:
# csv 파일 읽어서 DataFrame 만들기
df = pd.read_csv('https://raw.githubusercontent.com/barkle2/Programming/master/%5BPython%5D%20Tutorial/friends.csv')

In [15]:
# 일반 정보 조회
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   job     6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [16]:
# DataFrame 크기
df.shape

(6, 3)

In [17]:
# DataFrame 원소 수
df.size

18

In [18]:
# 앞쪽 데이터 보기 head()
df.head() # default로 5개 보여준다.

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [19]:
# 뒤쪽 데이터 보기 tail()
df.tail(3)

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

### 2-2. DataFrame 선택

In [20]:
# 1, 2번 행만 선택하기
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [21]:
# 특정 행만 선택하기
select_list = [0,2]
df.loc[select_list]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [22]:
# 조건으로 선택하기
df[df.age > 25]
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [23]:
# 다중 조건
df[(df.age>25) & (df.name=='Nate')]

   name  age      job
2  Nate   30  teacher

In [24]:
# index로 컬럼 필터링
df.iloc[1:5, 0:2]

    name  age
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45

In [25]:
# name으로 컬럼 필터링
df[['name', 'age']]
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [26]:
# 이름에 a가 들어간 컬럼만 선택
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [27]:
# 정규표현식으로 이름이 b로 끝나는 컬럼 선택하기
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

### 2-3. DataFrame 조작

In [28]:
# DataFrame 컬럼 순서 바꾸기
df = df[['age', 'name', 'job']]
df

   age   name        job
0   20   John    student
1   30  Jenny  developer
2   30   Nate    teacher
3   40  Julia    dentist
4   45  Brian    manager
5   25  Chris     intern

In [29]:
# 컬럼 이름 바꾸기 1
df.columns = ['나이', '이름', '직업'] # 모든 컬럼을 지정해야 함
df

   나이     이름         직업
0  20   John    student
1  30  Jenny  developer
2  30   Nate    teacher
3  40  Julia    dentist
4  45  Brian    manager
5  25  Chris     intern

In [30]:
# 컬럼 이름 바꾸기 2
df.rename(columns = {'나이':'age'}, inplace=True)
df.rename(columns = {'이름':'name', '직업':'job'}, inplace=True)
df

   age   name        job
0   20   John    student
1   30  Jenny  developer
2   30   Nate    teacher
3   40  Julia    dentist
4   45  Brian    manager
5   25  Chris     intern

In [31]:
# 인덱스로 행 삭제하기
df.drop([2,4])
# 옵션으로 inplace=True를 추가하면 df가 변환됨
#df.drop([2,4], inplace=True)

   age   name        job
0   20   John    student
1   30  Jenny  developer
3   40  Julia    dentist
5   25  Chris     intern

In [32]:
# 열 삭제하기
df.drop('age', axis=1)
# 옵션으로 inplace=True를 추가하면 df가 변환됨
#df.drop('age', axis=1, inplace=True)

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher
3  Julia    dentist
4  Brian    manager
5  Chris     intern

In [33]:
# 열을 생성하려면 그냥 df['생성할열이름'] 을 정의하면 된다.
# numpy의 where 함수를 사용하여 열 생성
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')
df

   age   name        job salary
0   20   John    student     no
1   30  Jenny  developer    yes
2   30   Nate    teacher    yes
3   40  Julia    dentist    yes
4   45  Brian    manager    yes
5   25  Chris     intern    yes

In [34]:
# 열 생성 예제
df['midterm'] = [80,70,75,90,30,50]
df['final'] = [40,60,80,90,70,50]
df['avg'] = (df['midterm'] + df['final']) / 2
df

   age   name        job salary  midterm  final   avg
0   20   John    student     no       80     40  60.0
1   30  Jenny  developer    yes       70     60  65.0
2   30   Nate    teacher    yes       75     80  77.5
3   40  Julia    dentist    yes       90     90  90.0
4   45  Brian    manager    yes       30     70  50.0
5   25  Chris     intern    yes       50     50  50.0

In [35]:

# 조건에 따른 리스트를 만들어 열 생성
grades = []
for row in df['avg']:
  if row >= 90:
    grades.append('A')
  elif row >= 80:
    grades.append('B')
  elif row >= 70:
    grades.append('C')
  elif row >= 60:
    grades.append('D')
  else:
    grades.append('F')
df['grade'] = grades
df

   age   name        job salary  midterm  final   avg grade
0   20   John    student     no       80     40  60.0     D
1   30  Jenny  developer    yes       70     60  65.0     D
2   30   Nate    teacher    yes       75     80  77.5     C
3   40  Julia    dentist    yes       90     90  90.0     A
4   45  Brian    manager    yes       30     70  50.0     F
5   25  Chris     intern    yes       50     50  50.0     F

In [36]:
# 함수를 이용하여 열 변경
def pass_or_fail(row):
  if row != 'F':
    return 'Pass'
  else:
    return 'Fail'

In [37]:
# 날짜를 원소값으로 갖는 리스트 만들기
date_list = [
  { 'yyyy-mm-dd':'2000-06-27'},
  { 'yyyy-mm-dd':'2007-10-27'}
]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [38]:
# 연도만 추출하는 함수 만들기
def extract_year(row):
  return row.split('-')[0]
  
# apply(extract_year) 를 사용하여 연도 추출하여 year 열 생성
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [39]:
# DataFrame을 하나더 만들어서 합치기
date_list2 = [
  { 'yyyy-mm-dd':'2005-03-10'},
  { 'yyyy-mm-dd':'2019-11-25'}
]
df2 = pd.DataFrame(date_list2, columns=['yyyy-mm-dd'])
df2['year'] = df2['yyyy-mm-dd'].apply(extract_year)
df2

   yyyy-mm-dd  year
0  2005-03-10  2005
1  2019-11-25  2019

In [40]:
# append 함수로 df와 df2를 합친다.
df.append(df2, ignore_index=True)

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007
2  2005-03-10  2005
3  2019-11-25  2019

## 3. Data 전처리

In [41]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

### 3-1. 중복값 제거하기

In [42]:
# 행 전체로 중복여부 확인하기
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [43]:
# 행 전체 중복값 제거하기
df.drop_duplicates()

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [44]:
# 특정 컬럼이 같으면 중복
df.duplicated(['major'])

0     False
1      True
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
dtype: bool

In [45]:
# 특정 컬럼이 같으면 행 전체 삭제
df.drop_duplicates(['major'], keep='first') # 중복값 중 첫번째 값을 보존
#df.drop_duplicates(['major'], keep='last') # 중복값 중 마지막 값을 보존

      name             major     sex
0     John  Computer Science    male
2  Abraham           Physics    male
3    Brian        Psychology    male
4    Janny         Economics  female

### 3-2. NaN 값 처리하기

In [46]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [47]:
# info() 명령어로 Non-Null 값이 있는지 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [48]:
# NaN 값 찾기
df.isna()
#df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [49]:
# NaN 값을 0으로 바꾸기
df.age = df.age.fillna(0)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [50]:
# 빈 age 값을 job group의 중위값으로 채우기
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace=True)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

## 4. 데이터 분석

In [51]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [52]:
# major 컬럼을 기준으로 그룹 만들기
groupby_major = df.groupby('major')
# 만들어진 그룹 확인
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [53]:
# 그룹 정보 보여주기
for name, group in groupby_major:
  print(name + " : " + str(len(group)))
  print(group)
  print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [54]:
# 전공별로 몇명이 있는지를 DataFrame으로 저장
df_major_cnt = pd.DataFrame( {'count':groupby_major.size()})
df_major_cnt

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [55]:
# 전공별로 몇명이 있는지를 DataFrame으로 저장 + major를 컬럼으로
df_major_cnt = pd.DataFrame( {'count':groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [56]:
# sex 컬럼을 기준으로 그룹 만들기
groupby_major = df.groupby('sex')
# 그룹 정보 보여주기
for name, group in groupby_major:
  print(name + " : " + str(len(group)))
  print(group)
  print()

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male